import math

"""
math.sqrt(x) — возвращает квадратный корень числа x. Например, math.sqrt(25) даст 5.0.
math.pow(x, y) — возводит x в степень y. Например, math.pow(2, 3) вернёт 8.0.
math.pi — константа Пи (примерно 3.14159).
math.e — основание натурального логарифма (примерно 2.71828).
math.sin(x), math.cos(x), math.tan(x) — тригонометрические функции, принимающие x в радианах.
math.log(x) — натуральный логарифм x.
math.log10(x) — десятичный логарифм x.
math.exp(x) — экспонента, возвращает ( e^x ).
math.factorial(x) — факториал числа x, например, math.factorial(5) вернёт 120.
math.ceil(x) — округляет x вверх до целого числа.
math.floor(x) — округляет x вниз до целого числа.
"""


b = 5.5
a = math.factorial(7)